## Car yard Analysis

In [2]:
import pandas as pd

car = pd.read_excel("Car Dealer.xlsx")
car.head()

     Make   Model   Color  Mileage  Price  Cost
0   Honda  Accord     Red    63512   4000  3000
1   Honda  Accord    Blue    95135   2500  2000
2   Honda  Accord  Silver   101354   2000  1500
3  Toyota   Camry   Black    75006   2198  1900
4  Nissan  Altima   Green    69847   3826  3000

## How to dispaly specific columns

In [16]:
car = pd.read_excel("Car Dealer.xlsx", usecols='A, B, C')
car.head()

     Make   Model   Color
0   Honda  Accord     Red
1   Honda  Accord    Blue
2   Honda  Accord  Silver
3  Toyota   Camry   Black
4  Nissan  Altima   Green

## Count the number of cars

In [18]:
total_cars=car.shape[0]
print(total_cars)

24

## Summary of car colors

In [24]:
colors = car.pivot_table(index=[], columns=['Color'], aggfunc='count')
print(colors)

Color  Black  Blue  Green  Red  Silver  White
Make       6     3      3    3       6      3
Model      6     3      3    3       6      3

## Adding discount column

In [5]:
import pandas as pd
car = pd.read_excel("Car Dealer.xlsx")
car['Discounted_Price'] = car.apply(lambda row: row.Price - row.Cost, axis = 1)
print(car)

         Make      Model   Color  Mileage  Price  Cost  Discounted_Price
0       Honda     Accord     Red    63512   4000  3000              1000
1       Honda     Accord    Blue    95135   2500  2000               500
2       Honda     Accord  Silver   101354   2000  1500               500
3      Toyota      Camry   Black    75006   2198  1900               298
4      Nissan     Altima   Green    69847   3826  3000               826
5      Nissan     Altima   Green    55233   2970  2500               470
6      Toyota    Corolla   Black    87278   2224  2100               124
7      Toyota    Corolla    Blue   130684   2798  2200               598
8      Toyota    Corolla  Silver    59169   2160  2000               160
9       Honda      Civic   White   138789   2723  1900               823
10       Ford      F-150   Black    89073   3950  3000               950
11  Chevrolet  Silverado   Green   109231   4959  4500               459
12  Chevrolet     Impala  Silver    87675   3791  3500               291
13  Chevrolet     Impala   White   140811   2340  2000               340
14  Chevrolet     Malibu   White   139300   3361  3000               361
15       Ford     Escape   Black    63259   3196  3050               146
16       Ford     Escape     Red    40826   4397  3900               497
17       Ford    Mustang  Silver    41560   3706  3100               606
18      Honda        CRV    Blue    49326   4745  4100               645
19     Nissan     Maxima     Red   101856   2914  2500               414
20       Ford     Fusion   Black    42542   2659  2100               559
21      Dodge    Charger  Silver    34853   4349  3500               849
22      Dodge    Charger  Silver    58173   4252  4000               252
23      Dodge    Charger   Black   136775   2090  1800               290

## Summary of number of each make in the yard

In [7]:
colors = car.pivot_table(index=[], columns=['Make'], aggfunc='count')
print(colors)

Make              Chevrolet  Dodge  Ford  Honda  Nissan  Toyota
Color                     4      3     5      5       3       4
Cost                      4      3     5      5       3       4
Discounted_Price          4      3     5      5       3       4
Mileage                   4      3     5      5       3       4
Model                     4      3     5      5       3       4
Price                     4      3     5      5       3       4

## List of car make with mileage gratee than 30000

In [19]:
car[car['Mileage'] > 80000]

         Make      Model   Color  Mileage  Price  Cost  Discounted_Price
1       Honda     Accord    Blue    95135   2500  2000               500
2       Honda     Accord  Silver   101354   2000  1500               500
6      Toyota    Corolla   Black    87278   2224  2100               124
7      Toyota    Corolla    Blue   130684   2798  2200               598
9       Honda      Civic   White   138789   2723  1900               823
10       Ford      F-150   Black    89073   3950  3000               950
11  Chevrolet  Silverado   Green   109231   4959  4500               459
12  Chevrolet     Impala  Silver    87675   3791  3500               291
13  Chevrolet     Impala   White   140811   2340  2000               340
14  Chevrolet     Malibu   White   139300   3361  3000               361
19     Nissan     Maxima     Red   101856   2914  2500               414
23      Dodge    Charger   Black   136775   2090  1800               290

## mileage is greater than 80000 and price 2000

In [24]:
car[(car['Mileage'] > 80000) & (car['Price'] >3000)]

         Make      Model   Color  Mileage  Price  Cost  Discounted_Price
10       Ford      F-150   Black    89073   3950  3000               950
11  Chevrolet  Silverado   Green   109231   4959  4500               459
12  Chevrolet     Impala  Silver    87675   3791  3500               291
14  Chevrolet     Malibu   White   139300   3361  3000               361

## SUM of each car make price

In [25]:
import pandas as pd
import numpy as np
car = pd.read_excel("Car Dealer.xlsx")

carMake = car.pivot_table(values='Price', index=['Color'],
                    columns=['Make'], aggfunc=np.sum)
print(carMake)

Make    Chevrolet   Dodge    Ford   Honda  Nissan  Toyota
Color
Black         NaN  2090.0  9805.0     NaN     NaN  4422.0
Blue          NaN     NaN     NaN  7245.0     NaN  2798.0
Green      4959.0     NaN     NaN     NaN  6796.0     NaN
Red           NaN     NaN  4397.0  4000.0  2914.0     NaN
Silver     3791.0  8601.0  3706.0  2000.0     NaN  2160.0
White      5701.0     NaN     NaN  2723.0     NaN     NaN

## count number of car make with certain colors

In [15]:
carColors = car.pivot_table(values='Price', index=['Color'],
                    columns=['Make'], aggfunc="count")
print(carColors)

Make    Chevrolet  Dodge  Ford  Honda  Nissan  Toyota
Color
Black         NaN    1.0   3.0    NaN     NaN     2.0
Blue          NaN    NaN   NaN    2.0     NaN     1.0
Green         1.0    NaN   NaN    NaN     2.0     NaN
Red           NaN    NaN   1.0    1.0     1.0     NaN
Silver        1.0    2.0   1.0    1.0     NaN     1.0
White         2.0    NaN   NaN    1.0     NaN     NaN

## calculate the average cost of each car make and model

In [14]:
carMake = car.pivot_table(values='Price', index=['Make','Model'],
                    columns=['Color'], aggfunc=np.average)
print(carMake)

Color                 Black    Blue   Green     Red  Silver   White
Make      Model
Chevrolet Impala        NaN     NaN     NaN     NaN  3791.0  2340.0
          Malibu        NaN     NaN     NaN     NaN     NaN  3361.0
          Silverado     NaN     NaN  4959.0     NaN     NaN     NaN
Dodge     Charger    2090.0     NaN     NaN     NaN  4300.5     NaN
Ford      Escape     3196.0     NaN     NaN  4397.0     NaN     NaN
          F-150      3950.0     NaN     NaN     NaN     NaN     NaN
          Fusion     2659.0     NaN     NaN     NaN     NaN     NaN
          Mustang       NaN     NaN     NaN     NaN  3706.0     NaN
Honda     Accord        NaN  2500.0     NaN  4000.0  2000.0     NaN
          CRV           NaN  4745.0     NaN     NaN     NaN     NaN
          Civic         NaN     NaN     NaN     NaN     NaN  2723.0
Nissan    Altima        NaN     NaN  3398.0     NaN     NaN     NaN
          Maxima        NaN     NaN     NaN  2914.0     NaN     NaN
Toyota    Camry      2198.0     NaN     NaN     NaN     NaN     NaN
          Corolla    2224.0  2798.0     NaN     NaN  2160.0     NaN

## Using Python crosstab

In [26]:
colorData=pd.crosstab(car['Make'], car['Color'])
print(colorData)

Color      Black  Blue  Green  Red  Silver  White
Make
Chevrolet      0     0      1    0       1      2
Dodge          1     0      0    0       2      0
Ford           3     0      0    1       1      0
Honda          0     2      0    1       1      1
Nissan         0     0      2    1       0      0
Toyota         2     1      0    0       1      0

## crosstabs can be simulated by group by

In [21]:
cols = ['Make', 'Color']
car.groupby(cols)[cols].count()

                  Make  Color
Make      Color
Chevrolet Green      1      1
          Silver     1      1
          White      2      2
Dodge     Black      1      1
          Silver     2      2
Ford      Black      3      3
          Red        1      1
          Silver     1      1
Honda     Blue       2      2
          Red        1      1
          Silver     1      1
          White      1      1
Nissan    Green      2      2
          Red        1      1
Toyota    Black      2      2
          Blue       1      1
          Silver     1      1

## adding a sum colunm to the filtered data

In [30]:

colorData['Color_sum'] = colorData.sum(axis=1)
print(colorData)

Color      Black  Blue  Green  Red  Silver  White  Color_sum
Make
Chevrolet      0     0      1    0       1      2          4
Dodge          1     0      0    0       2      0          3
Ford           3     0      0    1       1      0          5
Honda          0     2      0    1       1      1          5
Nissan         0     0      2    1       0      0          3
Toyota         2     1      0    0       1      0          4

## counting rows and columns

In [39]:
row_count= car.shape[0]
print(row_count)

col_count= car.shape[1]
print(col_count)

24
7

column_count= car.shape[1]
print(column_count)

In [ ]:
queryData=car.query